{
    "peliculas": [
      {
        "titulo": "Avengers: Endgame",
        "descripcion": "Después de los devastadores eventos de Avengers: Infinity War, los superhéroes restantes se reúnen para deshacer las acciones de Thanos y restaurar el orden en el universo.",
        "anio_estreno": 2019,
        "idioma": "Inglés",
        "trama": "Después de la desaparición de la mitad de toda la vida en el universo, los Vengadores restantes deben reunirse y enfrentar su mayor desafío hasta ahora: encontrar una forma de revertir las acciones de Thanos y restaurar el equilibrio en el universo.",
        "pais": "Estados Unidos",
        "generos": "Acción, Aventura, Fantasía",
        "poster": "https://www.example.com/poster1.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "Parasite",
        "descripcion": "La vida de una familia pobre cambia cuando su hijo comienza a trabajar para una familia adinerada, desencadenando una serie de eventos impredecibles.",
        "anio_estreno": 2019,
        "idioma": "Coreano",
        "trama": "Un joven llamado Ki-woo se introduce en la casa de los Park haciéndose pasar por un tutor de inglés para las hijas de la familia. A medida que la relación de los Kim con los Park se vuelve más profunda, se ven envueltos en un incidente inesperado.",
        "pais": "Corea del Sur",
        "generos": "Drama, Comedia, Suspenso",
        "poster": "https://www.example.com/poster2.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "La La Land",
        "descripcion": "Un pianista de jazz y una aspirante a actriz se enamoran en Los Ángeles mientras persiguen sus sueños de fama y fortuna.",
        "anio_estreno": 2016,
        "idioma": "Inglés",
        "trama": "En la ciudad de Los Ángeles, Mia, una aspirante a actriz, y Sebastian, un pianista de jazz, se enamoran mientras luchan por perseguir sus sueños en una ciudad conocida por destruir esperanzas y romper corazones.",
        "pais": "Estados Unidos",
        "generos": "Comedia musical, Drama, Romance",
        "poster": "https://www.example.com/poster3.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "The Shawshank Redemption",
        "descripcion": "Dos hombres encuentran redención en una prisión mientras forjan una profunda amistad a lo largo de los años.",
        "anio_estreno": 1994,
        "idioma": "Inglés",
        "trama": "Andy Dufresne, un banquero injustamente condenado a cadena perpetua, encuentra esperanza y redención en la cárcel de Shawshank mientras se hace amigo de un prisionero llamado Red.",
        "pais": "Estados Unidos",
        "generos": "Drama",
        "poster": "https://www.example.com/poster4.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "Inception",
        "descripcion": "Un ladrón de sueños realiza un último trabajo: implantar una idea en la mente de un individuo mientras sueña.",
        "anio_estreno": 2010,
        "idioma": "Inglés",
        "trama": "Dominic Cobb es un ladrón de sueños hábil que se especializa en la extracción de información valiosa del subconsciente de las personas mientras sueñan. Se le ofrece la oportunidad de realizar una tarea aparentemente imposible: implantar una idea en la mente de alguien.",
        "pais": "Estados Unidos",
        "generos": "Acción, Aventura, Ciencia ficción",
        "poster": "https://www.example.com/poster5.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "The Godfather",
        "descripcion": "La historia épica de la familia Corleone y su involucramiento en el crimen organizado.",
        "anio_estreno": 1972,
        "idioma": "Inglés",
        "trama": "El patriarca de la familia Corleone, Vito, transfiere el control de su imperio criminal a su hijo menor, Michael, lo que desencadena una serie de eventos violentos y una lucha por el poder dentro de la mafia.",
        "pais": "Estados Unidos",
        "generos": "Drama, Crimen",
        "poster": "https://www.example.com/poster6.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "Pulp Fiction",
        "descripcion": "Una historia entrelazada sobre criminales, cajas misteriosas y una pareja danzarina.",
        "anio_estreno": 1994,
        "idioma": "Inglés",
        "trama": "Pulp Fiction sigue a varias historias entrelazadas de criminales de Los Ángeles, incluyendo a dos asesinos a sueldo, un boxeador, un gánster y su esposa, y un par de ladrones de poca monta.",
        "pais": "Estados Unidos",
        "generos": "Crimen, Drama",
        "poster": "https://www.example.com/poster7.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "The Dark Knight",
        "descripcion": "Batman se enfrenta a su némesis, el Joker, en una batalla por la ciudad de Gotham.",
        "anio_estreno": 2008,
        "idioma": "Inglés",
        "trama": "Batman se enfrenta al Joker, un villano psicópata que amenaza con sumir a Gotham City en el caos. Mientras Batman lucha contra el Joker, también debe lidiar con la corrupción dentro de la policía de la ciudad.",
        "pais": "Estados Unidos",
        "generos": "Acción, Crimen, Drama",
        "poster": "https://www.example.com/poster8.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "The Matrix",
        "descripcion": "Un hacker descubre que el mundo en el que vive es una simulación controlada por máquinas y se une a la resistencia humana para luchar contra ellas.",
        "anio_estreno": 1999,
        "idioma": "Inglés",
        "trama": "Thomas Anderson, un programador de computadoras y hacker conocido como Neo, descubre que el mundo en el que vive es una simulación creada por máquinas inteligentes. Se une a un grupo de rebeldes humanos para luchar contra las máquinas y liberar a la humanidad.",
        "pais": "Estados Unidos",
        "generos": "Acción, Ciencia ficción",
        "poster": "https://www.example.com/poster9.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "Forrest Gump",
        "descripcion": "La vida de Forrest Gump, un hombre de inteligencia limitada pero corazón bondadoso, quien se encuentra en medio de importantes eventos históricos.",
        "anio_estreno": 1994,
        "idioma": "Inglés",
        "trama": "Forrest Gump es un hombre con discapacidad intelectual pero una determinación inquebrantable. A lo largo de su vida, se encuentra con importantes figuras históricas y se ve envuelto en eventos clave de la historia de Estados Unidos, mientras busca el amor y la felicidad.",
        "pais": "Estados Unidos",
        "generos": "Drama, Comedia",
        "poster": "https://www.example.com/poster10.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "The Lord of the Rings: The Fellowship of the Ring",
        "descripcion": "Un grupo de seres de diferentes razas se embarca en una épica aventura para destruir un poderoso anillo y salvar a la Tierra Media del malvado Señor Oscuro.",
        "anio_estreno": 2001,
        "idioma": "Inglés",
        "trama": "Frodo Baggins, un hobbit tímido, es elegido para llevar un anillo mágico al Monte del Destino y destruirlo para evitar que el Señor Oscuro Sauron lo recupere y sumerja a la Tierra Media en la oscuridad.",
        "pais": "Estados Unidos, Nueva Zelanda",
        "generos": "Aventura, Fantasía",
        "poster": "https://www.example.com/poster11.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "The Great Gatsby",
        "descripcion": "La historia de amor entre un hombre misterioso y una mujer casada durante la próspera era del jazz en la década de 1920.",
        "anio_estreno": 2013,
        "idioma": "Inglés",
        "trama": "Jay Gatsby, un hombre enigmático y millonario, se enamora de Daisy Buchanan, una mujer casada. Su obsesión por recuperar su amor perdido los lleva a un viaje de decadencia, pasión y tragedia durante la vibrante era del jazz en Nueva York.",
        "pais": "Estados Unidos, Australia",
        "generos": "Drama, Romance",
        "poster": "https://www.example.com/poster12.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "Interstellar",
        "descripcion": "Un grupo de astronautas viaja a través de un agujero de gusano en busca de un nuevo hogar para la humanidad debido a la crisis climática en la Tierra.",
        "anio_estreno": 2014,
        "idioma": "Inglés",
        "trama": "En un futuro donde la Tierra se enfrenta a una crisis climática devastadora, un grupo de astronautas emprende un viaje interestelar a través de un agujero de gusano en busca de un nuevo hogar para la humanidad.",
        "pais": "Estados Unidos, Reino Unido",
        "generos": "Aventura, Drama, Ciencia ficción",
        "poster": "https://www.example.com/poster13.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "The Lion King",
        "descripcion": "La historia de Simba, un joven león destinado a convertirse en rey y enfrentar a su malvado tío para reclamar su lugar en el ciclo de la vida.",
        "anio_estreno": 1994,
        "idioma": "Inglés",
        "trama": "Simba, un joven león heredero del trono, es exiliado por su malvado tío Scar después de la muerte de su padre. Con la ayuda de nuevos amigos, Simba debe encontrar el coraje para enfrentarse a su pasado y reclamar su lugar como rey.",
        "pais": "Estados Unidos",
        "generos": "Animación, Aventura, Drama",
        "poster": "https://www.example.com/poster14.jpg",
        "clasificacion": "G"
      },
      {
        "titulo": "Titanic",
        "descripcion": "La historia de amor trágica entre Rose y Jack, que se conocen a bordo del legendario transatlántico Titanic.",
        "anio_estreno": 1997,
        "idioma": "Inglés",
        "trama": "Rose, una joven de clase alta, se enamora de Jack, un pasajero de tercera clase, a bordo del lujoso transatlántico Titanic. Su apasionado romance se ve amenazado por el trágico destino del barco.",
        "pais": "Estados Unidos",
        "generos": "Drama, Romance",
        "poster": "https://www.example.com/poster15.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "The Avengers",
        "descripcion": "Los superhéroes de Marvel se unen para enfrentarse a una amenaza extraterrestre que busca conquistar la Tierra.",
        "anio_estreno": 2012,
        "idioma": "Inglés",
        "trama": "Cuando un poderoso villano llamado Loki amenaza con invadir la Tierra, Nick Fury, el director de S.H.I.E.L.D., reúne a un grupo de superhéroes para detenerlo. Los Vengadores deben aprender a trabajar juntos y desplegar sus habilidades extraordinarias para proteger al planeta.",
        "pais": "Estados Unidos",
        "generos": "Acción, Aventura, Fantasía",
        "poster": "https://www.example.com/poster16.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "Jurassic Park",
        "descripcion": "Un multimillonario crea un parque temático con dinosaurios reales, pero las cosas salen mal cuando los dinosaurios escapan y comienzan a causar estragos.",
        "anio_estreno": 1993,
        "idioma": "Inglés",
        "trama": "Un grupo de personas es invitado a visitar Jurassic Park, un parque temático lleno de dinosaurios clonados. Sin embargo, cuando el sistema de seguridad falla, los dinosaurios escapan y los visitantes deben luchar por sobrevivir mientras son perseguidos por las criaturas prehistóricas.",
        "pais": "Estados Unidos",
        "generos": "Aventura, Ciencia ficción, Suspenso",
        "poster": "https://www.example.com/poster17.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "The Social Network",
        "descripcion": "La historia del ascenso de Mark Zuckerberg y la creación de Facebook, la red social más popular del mundo.",
        "anio_estreno": 2010,
        "idioma": "Inglés",
        "trama": "Esta película narra la historia de Mark Zuckerberg, un estudiante de Harvard que crea el sitio web de redes sociales llamado Facebook. A medida que Facebook se vuelve cada vez más exitoso, Mark se enfrenta a demandas legales y traiciones personales mientras lucha por mantener el control de su creación.",
        "pais": "Estados Unidos",
        "generos": "Biografía, Drama",
        "poster": "https://www.example.com/poster18.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "The Dark Knight Rises",
        "descripcion": "Batman regresa para enfrentarse a Bane, un terrorista que amenaza a Gotham City.",
        "anio_estreno": 2012,
        "idioma": "Inglés",
        "trama": "Ocho años después de los eventos de The Dark Knight, Batman regresa para proteger a Gotham City de Bane, un enemigo formidable que busca sumir a la ciudad en el caos.",
        "pais": "Estados Unidos, Reino Unido",
        "generos": "Acción, Aventura, Crimen",
        "poster": "https://www.example.com/poster21.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "The Pursuit of Happyness",
        "descripcion": "La inspiradora historia de un padre soltero que lucha por construir una vida mejor para él y su hijo.",
        "anio_estreno": 2006,
        "idioma": "Inglés",
        "trama": "Basada en una historia real, la película sigue a Chris Gardner, un padre soltero que enfrenta dificultades financieras. A pesar de los desafíos, lucha por superar la adversidad y construir una vida mejor para él y su hijo.",
        "pais": "Estados Unidos",
        "generos": "Biografía, Drama",
        "poster": "https://www.example.com/poster22.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "The Notebook",
        "descripcion": "Una historia de amor épica y conmovedora que trasciende el tiempo y los obstáculos.",
        "anio_estreno": 2004,
        "idioma": "Inglés",
        "trama": "En la década de 1940, Allie, una joven adinerada, se enamora de Noah, un trabajador local. A pesar de las diferencias sociales y los obstáculos que enfrentan, su amor persiste a lo largo de los años, dejando una huella imborrable en sus vidas.",
        "pais": "Estados Unidos",
        "generos": "Drama, Romance",
        "poster": "https://www.example.com/poster23.jpg",
        "clasificacion": "PG-13"
      },
      {
        "titulo": "The Wolf of Wall Street",
        "descripcion": "La historia de Jordan Belfort, un corredor de bolsa que se involucra en actividades fraudulentas y excesos desenfrenados.",
        "anio_estreno": 2013,
        "idioma": "Inglés",
        "trama": "Basada en hechos reales, la película sigue la vida de Jordan Belfort, un ambicioso corredor de bolsa que se involucra en actividades fraudulentas y lleva una vida de excesos desenfrenados, enfrentando las consecuencias de sus acciones.",
        "pais": "Estados Unidos",
        "generos": "Biografía, Comedia, Crimen",
        "poster": "https://www.example.com/poster24.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "Inglourious Basterds",
        "descripcion": "Un grupo de soldados judíos y una espía se unen para llevar a cabo una misión letal durante la Segunda Guerra Mundial.",
        "anio_estreno": 2009,
        "idioma": "Inglés, Alemán, Francés",
        "trama": "Durante la Segunda Guerra Mundial, un grupo de soldados judíos conocidos como los Bastardos se unen con una espía alemana para llevar a cabo una misión de venganza contra líderes nazis, mientras conspiran para asesinar a Adolf Hitler.",
        "pais": "Estados Unidos, Alemania",
        "generos": "Aventura, Drama, Bélico",
        "poster": "https://www.example.com/poster25.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "Fight Club",
        "descripcion": "Un hombre desilusionado forma un club de lucha clandestino como forma de escape de su vida monótona.",
        "anio_estreno": 1999,
        "idioma": "Inglés",
        "trama": "Un hombre anónimo y desilusionado encuentra un escape de su vida monótona al formar un club de lucha clandestino, pero las cosas se complican cuando se involucra en un juego peligroso con consecuencias inesperadas.",
        "pais": "Estados Unidos, Alemania",
        "generos": "Drama",
        "poster": "https://www.example.com/poster26.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "The Grand Budapest Hotel",
        "descripcion": "Las extravagantes aventuras de un conserje y su joven protegido en un famoso hotel europeo.",
        "anio_estreno": 2014,
        "idioma": "Inglés",
        "trama": "La película sigue las extravagantes aventuras de Gustave H., el conserje de un famoso hotel europeo, y Zero Moustafa, su joven protegido, mientras se ven envueltos en un robo, un asesinato y una búsqueda de un valioso tesoro.",
        "pais": "Estados Unidos, Alemania",
        "generos": "Comedia, Drama",
        "poster": "https://www.example.com/poster27.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "Eternal Sunshine of the Spotless Mind",
        "descripcion": "Una pareja se somete a un procedimiento médico para borrar los recuerdos de su relación, pero el amor no se olvida tan fácilmente.",
        "anio_estreno": 2004,
        "idioma": "Inglés",
        "trama": "Joel y Clementine, una pareja que ha terminado su relación, se someten a un procedimiento médico experimental para borrar los recuerdos de su amor. Mientras sus recuerdos comienzan a desvanecerse, se dan cuenta de que todavía hay algo especial entre ellos.",
        "pais": "Estados Unidos",
        "generos": "Drama, Romance, Ciencia ficción",
        "poster": "https://www.example.com/poster29.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "The Matrix",
        "descripcion": "Un programador descubre que el mundo en el que vive es una simulación y se une a una rebelión para luchar contra las máquinas que lo controlan.",
        "anio_estreno": 1999,
        "idioma": "Inglés",
        "trama": "Thomas Anderson, un programador de computadoras conocido como Neo, descubre que la realidad en la que vive es una simulación creada por máquinas inteligentes. Se une a una rebelión humana para luchar contra las máquinas y liberar a la humanidad de su control.",
        "pais": "Estados Unidos",
        "generos": "Acción, Ciencia ficción",
        "poster": "https://www.example.com/poster30.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "The Silence of the Lambs",
        "descripcion": "Una joven agente del FBI busca la ayuda de un psiquiatra caníbal para atrapar a un peligroso asesino en serie.",
        "anio_estreno": 1991,
        "idioma": "Inglés",
        "trama": "Clarice Starling, una joven agente del FBI, busca la ayuda del brillante psiquiatra caníbal Dr. Hannibal Lecter para capturar a Buffalo Bill, un peligroso asesino en serie. Enfrentada a un juego psicológico aterrador, Clarice debe confiar en Lecter para resolver el caso.",
        "pais": "Estados Unidos",
        "generos": "Drama, Crimen, Suspenso",
        "poster": "https://www.example.com/poster38.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "The Green Mile",
        "descripcion": "La historia de un guardia de prisión y su inusual relación con un prisionero con poderes misteriosos.",
        "anio_estreno": 1999,
        "idioma": "Inglés",
        "trama": "The Green Mile sigue la vida de Paul Edgecomb, un guardia de prisión en el corredor de la muerte de una penitenciaría en 1930. La llegada de un prisionero llamado John Coffey, que posee poderes misteriosos, desafía las creencias y cambia la vida de Edgecomb para siempre.",
        "pais": "Estados Unidos",
        "generos": "Drama, Fantasía, Crimen",
        "poster": "https://www.example.com/poster40.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "The Exorcist",
        "descripcion": "La posesión demoníaca de una niña y los intentos de un sacerdote por salvarla.",
        "anio_estreno": 1973,
        "idioma": "Inglés",
        "trama": "The Exorcist sigue la historia de Regan MacNeil, una niña que es poseída por una entidad demoníaca. Su madre busca la ayuda de un sacerdote que se enfrenta a la lucha sobrenatural para salvar el alma de la niña.",
        "pais": "Estados Unidos",
        "generos": "Terror",
        "poster": "https://www.example.com/poster41.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "Psycho",
        "descripcion": "La historia de Norman Bates, el propietario de un motel con oscuros secretos.",
        "anio_estreno": 1960,
        "idioma": "Inglés",
        "trama": "Psycho sigue la vida de Norman Bates, un joven con una relación complicada con su madre y propietario de un motel aislado. Cuando una mujer se registra en el motel y desaparece misteriosamente, se desencadenan una serie de eventos perturbadores.",
        "pais": "Estados Unidos",
        "generos": "Terror, Suspenso",
        "poster": "https://www.example.com/poster42.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "The Shining",
        "descripcion": "Un escritor y su familia se mudan a un hotel aislado donde se desatan fuerzas sobrenaturales.",
        "anio_estreno": 1980,
        "idioma": "Inglés",
        "trama": "The Shining sigue a Jack Torrance, un escritor en busca de inspiración, y su familia mientras se mudan a un hotel aislado durante el invierno. Conforme la soledad y el aislamiento se apoderan de ellos, fuerzas sobrenaturales desencadenan la creciente locura de Jack.",
        "pais": "Reino Unido, Estados Unidos",
        "generos": "Terror, Drama",
        "poster": "https://www.example.com/poster43.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "Halloween",
        "descripcion": "La historia de Michael Myers, un asesino enmascarado que aterroriza a una pequeña ciudad.",
        "anio_estreno": 1978,
        "idioma": "Inglés",
        "trama": "Halloween sigue a Michael Myers, un asesino enmascarado que escapa del hospital psiquiátrico y aterroriza a la ciudad de Haddonfield en la noche de Halloween. La joven Laurie Strode se convierte en su principal objetivo mientras lucha por sobrevivir.",
        "pais": "Estados Unidos",
        "generos": "Terror",
        "poster": "https://www.example.com/poster44.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "A Nightmare on Elm Street",
        "descripcion": "Un asesino sobrenatural acecha y asesina a adolescentes en sus sueños.",
        "anio_estreno": 1984,
        "idioma": "Inglés",
        "trama": "A Nightmare on Elm Street sigue a un grupo de adolescentes acosados por Freddy Krueger, un asesino sobrenatural que acecha y asesina a sus víctimas en sus sueños. A medida que descubren la verdad detrás de su existencia, deben encontrar la forma de detenerlo antes de que sea demasiado tarde.",
        "pais": "Estados Unidos",
        "generos": "Terror",
        "poster": "https://www.example.com/poster45.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "American Beauty",
        "descripcion": "La vida de una familia aparentemente perfecta se desmorona en medio de la insatisfacción y la búsqueda de la verdadera felicidad.",
        "anio_estreno": 1999,
        "idioma": "Inglés",
        "trama": "American Beauty examina la vida de la familia Burnham y sus vecinos, revelando las tensiones y la insatisfacción ocultas debajo de una apariencia aparentemente perfecta. La película explora temas de belleza, deseo y búsqueda de la verdadera felicidad en una sociedad superficial.",
        "pais": "Estados Unidos",
        "generos": "Drama",
        "poster": "https://www.example.com/poster49.jpg",
        "clasificacion": "R"
      },
      {
        "titulo": "The Pursuit of Happyness",
        "descripcion": "La inspiradora historia de un padre soltero que lucha por construir una vida mejor para él y su hijo.",
        "anio_estreno": 2006,
        "idioma": "Inglés",
        "trama": "Basada en una historia real, la película sigue a Chris Gardner, un padre soltero que enfrenta dificultades financieras. A pesar de los desafíos, lucha por superar la adversidad y construir una vida mejor para él y su hijo.",
        "pais": "Estados Unidos",
        "generos": "Biografía, Drama",
        "poster": "https://www.example.com/poster50.jpg",
        "clasificacion": "PG-13"
      }
    ]
  }
  